#+TITLE: Advent of Code 2024
#+SUBTITLE: Day 8: Resonant Collinearity
#+AUTHOR: Michael R. Mauger
#+DATE: [Mon Dec  9 16:50:24 EST 2024]
#+STARTUP: showeverything inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
#+OPTIONS: num:nil

#+AUTO_TANGLE: t
#+PROPERTY: header-args    :tangle no
#+PROPERTY: header-args    :noweb no-export

* Execution

#+BEGIN_example
............
........0...
.....0......
.......0....
....0.......
......A.....
............
............
........A...
.........A..
............
............
#+END_example


#+BEGIN_SRC bash :results output
  guile3.0 --auto-compile resonant-collinearity.scm example.dat
  guile3.0 --auto-compile resonant-collinearity.scm input.dat
#+END_SRC

#+RESULTS:
: Part One: Resonant Collinearity in "example.dat": 14
: Part Two: Resonant Collinearity in "example.dat": 34
: Part One: Resonant Collinearity in "input.dat": 280
: Part Two: Resonant Collinearity in "input.dat": 958
